## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # aws_security_group_rule.ecs_tasks_egress_rds will be destroyed
  # (because aws_security_group_rule.ecs_tasks_egress_rds is not in configuration)
  - resource "aws_security_group_rule" "ecs_tasks_egress_rds" {
      - description              = "Allow outbound traffic to RDS PostgreSQL" -> null
      - from_port                = 5432 -> null
      - id                       = "sgrule-445235166" -> null
      - protocol                 = "tcp" -> null
      - region                   = "ca-central-1" -> null
      - security_group_id        = "sg-0df4b23e35e4a459c" -> null
      - security_group_rule_id   = "sgr-021d2ce88a3e07281" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-0710b5b8c6d648561" -> null
      - to_port                  = 5432 -> null
      - type                     = "egress" -> null
    }

  # module.ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + region                   = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "blawx-staging-service"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:278626299035:task-definition/blawx-staging-service:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:278626299035:task-definition/blawx-staging-service" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  + linuxParameters        = {
                      + capabilities = {
                          + add  = []
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  ~ name                   = "blawx-container" -> "blawx-staging-service"
                  - portMappings           = [
                      - {
                          - containerPort = 8000
                          - hostPort      = 8000
                          - protocol      = "tcp"
                        },
                    ]
                  ~ readonlyRootFilesystem = false -> true
                  - ulimits                = [
                      - {
                          - hardLimit = 1000000
                          - name      = "nofile"
                          - softLimit = 1000000
                        },
                    ]
                    # (8 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "blawx-staging-service" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "CostCentre" = "blawx-staging"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)

      ~ runtime_platform {
          ~ cpu_architecture        = "X86_64" -> "ARM64" # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # module.ecs.aws_iam_policy.this_task[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_iam_policy" "this_task" {
      - arn              = "arn:aws:iam::278626299035:policy/blawx-staging-service_ecs_task_policy" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::278626299035:policy/blawx-staging-service_ecs_task_policy" -> null
      - name             = "blawx-staging-service_ecs_task_policy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssm:GetParametersByPath",
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:278626299035:parameter/blawx/staging/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAUBX3L5SNSBVCPIA4D" -> null
      - tags             = {
          - "CostCentre" = "blawx-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all         = {
          - "CostCentre" = "blawx-staging"
          - "Terraform"  = "true"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.ecs.aws_iam_policy.this_task_exec will be updated in-place
  ~ resource "aws_iam_policy" "this_task_exec" {
        id               = "arn:aws:iam::278626299035:policy/blawx-staging-service_ecs_task_exec_policy"
        name             = "blawx-staging-service_ecs_task_exec_policy"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                    # (2 unchanged elements hidden)
                    {
                        Action   = [
                            "logs:PutLogEvents",
                            "logs:DescribeLogStreams",
                            "logs:CreateLogStream",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:logs:ca-central-1:278626299035:log-group:/aws/ecs/blawx-staging-cluster/blawx-staging-service:*"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParametersByPath",
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:278626299035:parameter/blawx/staging/*"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "CostCentre" = "blawx-staging"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.ecs.aws_iam_role_policy_attachment.this_task[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_iam_role_policy_attachment" "this_task" {
      - id         = "blawx-staging-service_ecs_task_role/arn:aws:iam::278626299035:policy/blawx-staging-service_ecs_task_policy" -> null
      - policy_arn = "arn:aws:iam::278626299035:policy/blawx-staging-service_ecs_task_policy" -> null
      - role       = "blawx-staging-service_ecs_task_role" -> null
    }

Plan: 1 to add, 1 to change, 4 to destroy.

Changes to Outputs:
  ~ task_definition_arn       = "arn:aws:ecs:ca-central-1:278626299035:task-definition/blawx-staging-service:1" -> (known after apply)
  ~ task_definition_revision  = 1 -> (known after apply)

Warning: Deprecated attribute

  on .terraform/modules/ecs.sentinel_forwarder/sentinel_forwarder/main.tf line 85, in resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription":
  85:   principal     = "logs.${data.aws_region.current.name}.amazonaws.com"

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and one more similar warning elsewhere)

Warning: Argument is deprecated

  with module.ecs.aws_service_discovery_service.this,
  on .terraform/modules/ecs/ecs/service_discovery.tf line 15, in resource "aws_service_discovery_service" "this":
  15:     failure_threshold = 1

failure_threshold is deprecated. The argument is no longer supported by AWS
and the value is always set to 1. The attribute will be removed in a future
major version.

Error: Missing required argument

  with module.ecs.aws_ecs_service.this,
  on .terraform/modules/ecs/ecs/main.tf line 45, in resource "aws_ecs_service" "this":
  45: resource "aws_ecs_service" "this" {

The argument "load_balancer.0.container_port" is required, but no definition
was found.
22:00:25.015 ERROR  terraform invocation failed in ./.terragrunt-cache/rbI9BuK9NONM5JQKPrks2SAewUw/62AzpPwfMjZSj_e-rUMJ4zakh20/ecs
22:00:25.015 ERROR  error occurred:

* Failed to execute "terraform plan -input=false -out=plan.tfplan -no-color" in ./.terragrunt-cache/rbI9BuK9NONM5JQKPrks2SAewUw/62AzpPwfMjZSj_e-rUMJ4zakh20/ecs
  
  Error: Missing required argument
  
    with module.ecs.aws_ecs_service.this,
    on .terraform/modules/ecs/ecs/main.tf line 45, in resource "aws_ecs_service" "this":
    45: resource "aws_ecs_service" "this" {
  
  The argument "load_balancer.0.container_port" is required, but no definition
  was found.
  
  exit status 1


```

</details>

